RT-Thread/rt-thread/bsp/freescale/platform/hal/src/sim/MKL27Z4/fsl_sim_hal_MKL27Z4.h
/*
* Copyright (c) 2013 - 2014, Freescale Semiconductor, Inc.
* All rights reserved.
*
* Redistribution and use in source and binary forms, with or without modification,
* are permitted provided that the following conditions are met:
*
* o Redistributions of source code must retain the above copyright notice, this list
*   of conditions and the following disclaimer.
*
* o Redistributions in binary form must reproduce the above copyright notice, this
*   list of conditions and the following disclaimer in the documentation and/or
*   other materials provided with the distribution.
*
* o Neither the name of Freescale Semiconductor, Inc. nor the names of its
*   contributors may be used to endorse or promote products derived from this
*   software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
* ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
* WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
* DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
* ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
* (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
* LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
* ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
* (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
* SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*/

#if !defined(__FSL_SIM_HAL_MKL27Z4_H__)
#define __FSL_SIM_HAL_MKL27Z4_H__


/*!
 * @addtogroup sim_hal_kl27z4
 * @{
 */
/*! @file*/

/*******************************************************************************
* Definitions
******************************************************************************/
/*! @brief COP clock source selection.*/
typedef enum _clock_cop_src {
    kClockCopSrcLpoClk,							 /*!< LPO clock 1K HZ.*/
    kClockCopSrcMcgIrClk, 						 /*!< MCG IRC Clock   */
    kClockCopSrcOsc0erClk, 						 /*!< OSCER Clock	  */
    kClockCopSrcBusClk							 /*!< BUS clock 	  */
#if (defined(DOXYGEN_OUTPUT) && (DOXYGEN_OUTPUT))
}clock_cop_src_kl27z4_t;
#else
}clock_cop_src_t;
#endif

/*! @brief SIM external reference clock source select (OSC32KSEL). */
typedef enum _clock_er32k_src
{
    kClockEr32kSrcOsc0 = 0U, /*!< OSC0 clock (OSC032KCLK).  */
    kClockEr32kSrcRtc  = 2U, /*!< RTC 32k clock .           */
    kClockEr32kSrcLpo  = 3U, /*!< LPO clock.                */
#if (defined(DOXYGEN_OUTPUT) && (DOXYGEN_OUTPUT))
} clock_er32k_src_kl27z4_t;
#else
} clock_er32k_src_t;
#endif

/*! @brief SIM external reference clock output pin select (OSC32KOUT). */
typedef enum _clock_osc32kout_sel
{
    kClockOsc32koutNone  = 0U,    /*!< ERCLK32K is not output.      */
    kClockOsc32koutPte0  = 1U,    /*!< ERCLK32K is output on PTE0.  */
    kClockOsc32koutPte26 = 2U,    /*!< ERCLK32K is output on PTE26. */
#if (defined(DOXYGEN_OUTPUT) && (DOXYGEN_OUTPUT))
} clock_osc32kout_sel_kl27z4_t;
#else
} clock_osc32kout_sel_t;
#endif

/*! @brief SIM LPUART clock source */
typedef enum _clock_lpuart_src
{
    kClockLpuartSrcNone,          /*!< disabled */
    kClockLpuartSrcIrc48M,	      /*!< IRC48M */
    kClockLpuartSrcOsc0erClk,	  /*!< OSCER clock */
    kClockLpuartSrcMcgIrClk 	  /*!< MCGIR clock */
#if (defined(DOXYGEN_OUTPUT) && (DOXYGEN_OUTPUT))
} clock_lpuart_src_kl27z4_t;
#else
} clock_lpuart_src_t;
#endif

/*! @brief SIM TPM clock source */
typedef enum _clock_tpm_src
{
    kClockTpmSrcNone,         /*!< disabled */
    kClockTpmSrcIrc48M,	      /*!< IRC48M/MCGPCLK */
    kClockTpmSrcOsc0erClk,	  /*!< OSCER clock */
    kClockTpmSrcMcgIrClk 	  /*!< MCGIR clock */
#if (defined(DOXYGEN_OUTPUT) && (DOXYGEN_OUTPUT))
} clock_tpm_src_kl27z4_t;
#else
} clock_tpm_src_t;
#endif

#if FSL_FEATURE_SOC_USB_COUNT
/*! @brief SIM USB FS clock source */
typedef enum _clock_usbfs_src
{
    kClockUsbfsSrcExt,       /*!< External bypass clock (USB_CLKIN)  */
    kClockUsbfsSrcIrc48M,    /*!< IRC48/MCGPCLK                      */
#if (defined(DOXYGEN_OUTPUT) && (DOXYGEN_OUTPUT))
} clock_usbfs_src_kl27z4_t;
#else
} clock_usbfs_src_t;
#endif
#endif// FSL_FEATURE_SOC_USB_COUNT

/*! @brief FLEXIO clock source. */
typedef enum _clock_flexio_src
{
    kClockFlexioSrcNone,      /*!< Clock disabled. */
    kClockFlexioSrcIrc48M,    /*!< MCGPCLK/IRC48M. */
    kClockFlexioSrcOsc0erClk, /*!< OSCERCLK.       */
    kClockFlexioSrcMcgIrClk,  /*!< MCGIRCLK.       */
#if (defined(DOXYGEN_OUTPUT) && (DOXYGEN_OUTPUT))
} clock_flexio_src_kl27z4_t;
#else
} clock_flexio_src_t;
#endif

/*! @brief LPTMR clock source select */
typedef enum _clock_lptmr_src_t
{
    kClockLptmrSrcMcgIrClk,        /*!< MCG out clock  */
    kClockLptmrSrcLpoClk,          /*!< LPO clock      */
    kClockLptmrSrcEr32kClk,        /*!< ERCLK32K clock */
    kClockLptmrSrcOsc0erClk,       /*!< OSCERCLK clock */
#if (defined(DOXYGEN_OUTPUT) && (DOXYGEN_OUTPUT))
} clock_lptmr_src_kl27z4_t;
#else
} clock_lptmr_src_t;
#endif

/*! @brief SIM CLKOUT_SEL clock source select */
typedef enum _clock_clkout_src
{
    kClockClkoutSelFlashClk  = 2U,  /*!< Flash clock    */
    kClockClkoutSelLpoClk    = 3U,  /*!< LPO clock      */
    kClockClkoutSelMcgIrClk  = 4U,  /*!< MCG out clock  */
    kClockClkoutSelOsc0erClk = 6U,  /*!< OSCER clock */
    kClockClkoutSelIrc48M    = 7U   /*!< IRC48M clock */
#if (defined(DOXYGEN_OUTPUT) && (DOXYGEN_OUTPUT))
} clock_clkout_src_kl27z4_t;
#else
} clock_clkout_src_t;
#endif

/*! @brief SIM RTCCLKOUTSEL clock source select */
typedef enum _clock_rtcout_src
{
    kClockRtcoutSrc1Hz,        /*!< 1Hz clock      */
    kClockRtcoutSrcOsc0erClk,  /*!< OSCER clock */
#if (defined(DOXYGEN_OUTPUT) && (DOXYGEN_OUTPUT))
} clock_rtcout_src_kl27z4_t;
#else
} clock_rtcout_src_t;
#endif

/*! @brief SIM ADCx pre-trigger select */
typedef enum _sim_adc_pretrg_sel
{
    kSimAdcPretrgselA,              /*!< Pre-trigger A selected for ADCx */
    kSimAdcPretrgselB               /*!< Pre-trigger B selected for ADCx */
#if (defined(DOXYGEN_OUTPUT) && (DOXYGEN_OUTPUT))
} sim_adc_pretrg_sel_kl27z4_t;
#else
} sim_adc_pretrg_sel_t;
#endif

/*! @brief SIM ADCx trigger select */
typedef enum _sim_adc_trg_sel
{
    kSimAdcTrgselExt        = 0U,         /*!< External trigger         */
    kSimAdcTrgSelComp0      = 1U,         /*!< CMP0 output              */
	kSimAdcTrgSelPit0       = 4U,         /*!< PIT trigger 0            */
    kSimAdcTrgSelPit1       = 5U,         /*!< PIT trigger 1            */
    kSimAdcTrgSelTpm0       = 8U,         /*!< TPM0 overflow            */
    kSimAdcTrgSelTpm1       = 9U,         /*!< TPM1 overflow            */
    kSimAdcTrgSelTpm2       = 10U,        /*!< TPM2 overflow            */
    kSimAdcTrgSelRtcAlarm	= 12U,        /*!< RTC alarm                */
    kSimAdcTrgSelRtcSec		= 13U,        /*!< RTC seconds              */
    kSimAdcTrgSelLptimer	= 14U,        /*!< Low-power timer trigger  */
#if (defined(DOXYGEN_OUTPUT) && (DOXYGEN_OUTPUT))
} sim_adc_trg_sel_kl27z4_t;
#else
} sim_adc_trg_sel_t;
#endif

/*! @brief LPUART receive data source. */
typedef enum _sim_lpuart_rxsrc
{
    kSimLpuartRxsrcPin,               /*!< LPUARTx_RX Pin */
    kSimLpuartRxsrcCmp0,              /*!< CMP0           */
#if (defined(DOXYGEN_OUTPUT) && (DOXYGEN_OUTPUT))
} sim_lpuart_rxsrc_kl27z4_t;
#else
} sim_lpuart_rxsrc_t;
#endif

/*! @brief LPUART transmit data source. */
typedef enum _sim_lpuart_txsrc
{
    kSimLpuartTxsrcPin,    /*!< UARTx_TX Pin */
    kSimLpuartTxsrcTpm1,   /*!< UARTx_TX pin modulated with TPM1 channel 0 output */
    kSimLpuartTxsrcTpm2,   /*!< UARTx_TX pin modulated with TPM2 channel 0 output */
#if (defined(DOXYGEN_OUTPUT) && (DOXYGEN_OUTPUT))
} sim_lpuart_txsrc_kl27z4_t;
#else
} sim_lpuart_txsrc_t;
#endif

/*! @brief SAI clock source */
typedef enum _clock_sai_src
{
    kClockSaiSrcSysClk     = 0U,  /*!< SYSCLK     */
    kClockSaiSrcOsc0erClk  = 1U,  /*!< OSC0ERCLK  */
    kClockSaiSrcMcgIrClk   = 2U,  /*!< MCGIRCLK   */
    kClockSaiSrcIrc48M     = 3U,  /*!< MCGPCLK/IRC48M. */
#if (defined(DOXYGEN_OUTPUT) && (DOXYGEN_OUTPUT))
} clock_sai_src_kl27z4_t;
#else
} clock_sai_src_t;
#endif

/*! @brief SIM Timer/PWM external clock select */
typedef enum _sim_tpm_clk_sel
{
    kSimTpmClkSel0,                 /*!< Timer/PWM TPM_CLKIN0 pin. */
    kSimTpmClkSel1                  /*!< Timer/PWM TPM_CLKIN1 pin. */
#if (defined(DOXYGEN_OUTPUT) && (DOXYGEN_OUTPUT))
} sim_tpm_clk_sel_kl27z4_t;
#else
} sim_tpm_clk_sel_t;
#endif

/*! @brief SIM Timer/PWM x channel y input capture source select */
typedef enum _sim_tpm_ch_src
{
    kSimTpmChSrc0,   /*!< Channel y input capture source uses 0. */
    kSimTpmChSrc1,   /*!< Channel y input capture source uses 1. */
    kSimTpmChSrc2,   /*!< Channel y input capture source uses 2. */
    kSimTpmChSrc3,   /*!< Channel y input capture source uses 3. */
#if (defined(DOXYGEN_OUTPUT) && (DOXYGEN_OUTPUT))
} sim_tpm_ch_src_kl27z4_t;
#else
} sim_tpm_ch_src_t;
#endif

#if FSL_FEATURE_SOC_USB_COUNT
/*! @brief SIM USB voltage regulator in standby mode setting during stop modes */
typedef enum _sim_usbsstby_mode
{
    kSimUsbsstbyNoRegulator,        /*!< regulator not in standby during Stop modes */
    kSimUsbsstbyWithRegulator       /*!< regulator in standby during Stop modes */
#if (defined(DOXYGEN_OUTPUT) && (DOXYGEN_OUTPUT))
} sim_usbsstby_mode_kl27z4_t;
#else
} sim_usbsstby_mode_t;
#endif

/*! @brief SIM USB voltage regulator in standby mode setting during VLPR and VLPW modes */
typedef enum _sim_usbvstby_mode
{
    kSimUsbvstbyNoRegulator,        /*!< regulator not in standby during VLPR and VLPW modes */
    kSimUsbvstbyWithRegulator       /*!< regulator in standby during VLPR and VLPW modes */
#if (defined(DOXYGEN_OUTPUT) && (DOXYGEN_OUTPUT))
} sim_usbvstby_mode_kl27z4_t;
#else
} sim_usbvstby_mode_t;
#endif
#endif// FSL_FEATURE_SOC_USB_COUNT

/*! @brief SIM SCGC bit index. */
#define FSL_SIM_SCGC_BIT(SCGCx, n) (((SCGCx-1U)<<5U) + n)

/*! @brief Clock gate name used for SIM_HAL_EnableClock/SIM_HAL_DisableClock. */
typedef enum _sim_clock_gate_name
{
    kSimClockGateI2c0      = FSL_SIM_SCGC_BIT(4U, 6U),
    kSimClockGateI2c1      = FSL_SIM_SCGC_BIT(4U, 7U),
    kSimClockGateUart2     = FSL_SIM_SCGC_BIT(4U, 12U),
#if FSL_FEATURE_SOC_USB_COUNT
    kSimClockGateUsbfs0    = FSL_SIM_SCGC_BIT(4U, 18U),
#endif
    kSimClockGateCmp0      = FSL_SIM_SCGC_BIT(4U, 19U),
    kSimClockGateVref0     = FSL_SIM_SCGC_BIT(4U, 20U),
    kSimClockGateSpi0      = FSL_SIM_SCGC_BIT(4U, 22U),
    kSimClockGateSpi1      = FSL_SIM_SCGC_BIT(4U, 23U),
    kSimClockGateLptmr0    = FSL_SIM_SCGC_BIT(5U, 0U),
    kSimClockGatePortA     = FSL_SIM_SCGC_BIT(5U, 9U),
    kSimClockGatePortB     = FSL_SIM_SCGC_BIT(5U, 10U),
    kSimClockGatePortC     = FSL_SIM_SCGC_BIT(5U, 11U),
    kSimClockGatePortD     = FSL_SIM_SCGC_BIT(5U, 12U),
    kSimClockGatePortE     = FSL_SIM_SCGC_BIT(5U, 13U),
#if FSL_FEATURE_SOC_SLCD_COUNT
    kSimClockGateSlcd0     = FSL_SIM_SCGC_BIT(5U, 19U),
#endif
    kSimClockGateLpuart0   = FSL_SIM_SCGC_BIT(5U, 20U),
    kSimClockGateLpuart1   = FSL_SIM_SCGC_BIT(5U, 21U),
    kSimClockGateFlexio0   = FSL_SIM_SCGC_BIT(5U, 31U),
    kSimClockGateFtf0      = FSL_SIM_SCGC_BIT(6U, 0U),
    kSimClockGateDmamux0   = FSL_SIM_SCGC_BIT(6U, 1U),
    kSimClockGateSai0      = FSL_SIM_SCGC_BIT(6U, 15U),
    kSimClockGatePit0      = FSL_SIM_SCGC_BIT(6U, 23U),
    kSimClockGateTpm0      = FSL_SIM_SCGC_BIT(6U, 24U),
    kSimClockGateTpm1      = FSL_SIM_SCGC_BIT(6U, 25U),
    kSimClockGateTpm2      = FSL_SIM_SCGC_BIT(6U, 26U),
    kSimClockGateAdc0      = FSL_SIM_SCGC_BIT(6U, 27U),
    kSimClockGateRtc0      = FSL_SIM_SCGC_BIT(6U, 29U),
    kSimClockGateDac0      = FSL_SIM_SCGC_BIT(6U, 31U),
    kSimClockGateDma0      = FSL_SIM_SCGC_BIT(7U, 8U),
#if (defined(DOXYGEN_OUTPUT) && (DOXYGEN_OUTPUT))
} sim_clock_gate_name_kl27z4_t;
#else
} sim_clock_gate_name_t;
#endif

/*@}*/

