RT-Thread/rt-thread/bsp/freescale/platform/hal/src/sim/MKL27Z4/fsl_sim_hal_MKL27Z4.h
}    

/*!
* @brief Gets the ADCx alternate trigger enable setting.
*
* This function gets the ADCx alternate trigger enable setting.
*
* @param base     Base address for current SIM instance.
* @param instance     device instance.
* @return enabled True if  ADCx alternate trigger is enabled
*/

static inline bool SIM_HAL_GetAdcAlternativeTriggerCmd(SIM_Type * base, uint32_t instance)
{
    bool retValue = false;
    
    retValue = SIM_BRD_SOPT7_ADC0ALTTRGEN(base);
    
    return retValue;
}

/*!
* @brief Sets the ADCx pre-trigger select setting.
*
* This function selects the ADCx pre-trigger source when the alternative
* triggers are enabled through ADCxALTTRGEN.
*
* @param base     Base address for current SIM instance.
* @param instance     device instance.
* @param select pre-trigger select setting for ADCx
*/
static inline void SIM_HAL_SetAdcPreTriggerMode(SIM_Type * base,
                                                uint32_t instance,
                                                sim_adc_pretrg_sel_t select)
{
    SIM_BWR_SOPT7_ADC0PRETRGSEL(base, select);
    
}
/*!
* @brief Gets the ADCx pre-trigger select setting.
*
* This function  gets the ADCx pre-trigger select setting.
*
* @param base     Base address for current SIM instance.
* @param instance     device instance.
* @return select ADCx pre-trigger select setting
*/
static inline sim_adc_pretrg_sel_t SIM_HAL_GetAdcPreTriggerMode(SIM_Type * base,
                                                                uint32_t instance)
{
    sim_adc_pretrg_sel_t retValue = (sim_adc_pretrg_sel_t)0;
    
    retValue = (sim_adc_pretrg_sel_t)SIM_BRD_SOPT7_ADC0PRETRGSEL(base);
    
    return retValue;
}

/*!
* @brief Sets the ADCx trigger select setting.
*
* This function  selects the ADCx trigger source when alternative triggers
* are enabled through ADCxALTTRGEN.
*
* @param base     Base address for current SIM instance.
* @param instance     device instance.
* @param select       trigger select setting for ADCx
*/
static inline void SIM_HAL_SetAdcTriggerMode(SIM_Type * base,
                                             uint32_t instance,
                                             sim_adc_trg_sel_t select)
{
    SIM_BWR_SOPT7_ADC0TRGSEL(base, select);
    
}

/*!
* @brief Gets the ADCx trigger select setting.
*
* This function  gets the ADCx trigger select setting.
*
* @param base     Base address for current SIM instance.
* @param instance     device instance.
* @return ADCx trigger select setting
*/
static inline sim_adc_trg_sel_t SIM_HAL_GetAdcTriggerMode(SIM_Type * base, uint32_t instance)
{
    sim_adc_trg_sel_t retValue = (sim_adc_trg_sel_t)0;
    
    retValue = (sim_adc_trg_sel_t)SIM_BRD_SOPT7_ADC0TRGSEL(base);
    
    return retValue;
}

/*!
* @brief Sets the ADCx trigger select setting in one function.
*
* This function sets ADC alternate trigger, pre-trigger mode and trigger mode.
*
* @param base     Base address for current SIM instance.
* @param instance     device instance.
* @param altTrigEn    Alternative trigger enable or not.
* @param preTrigSel   Pre-trigger mode.
* @param trigSel      Trigger mode.
*/
void SIM_HAL_SetAdcTriggerModeOneStep(SIM_Type * base,
                                      uint32_t instance,
                                      bool    altTrigEn,
                                      sim_adc_pretrg_sel_t preTrigSel,
                                      sim_adc_trg_sel_t trigSel);

/*!
* @brief Sets the LPUARTx receive data source select setting.
*
* This function  selects the source for the LPUARTx receive data.
*
* @param base Register base address of SIM.
* @param instance LPUART instance.
* @param select the source for the LPUARTx receive data
*/
void SIM_HAL_SetLpuartRxSrcMode(SIM_Type * base,
                                uint32_t instance,
                                sim_lpuart_rxsrc_t select);

/*!
* @brief Gets the LPUARTx receive data source select setting.
*
* This function  gets the LPUARTx receive data source select setting.
*
* @param base Register base address of SIM.
* @param instance LPUART instance.
*
* @return select UARTx receive data source select setting
*/
sim_lpuart_rxsrc_t SIM_HAL_GetLpuartRxSrcMode(SIM_Type * base, uint32_t instance);

/*!
* @brief Sets the LPUARTx transmit data source select setting.
*
* This function  selects the source for the LPUARTx transmit data.
*
* @param base Register base address of SIM.
* @param instance LPUART instance.
* @param select the source for the UARTx transmit data.
*/
void SIM_HAL_SetLpuartTxSrcMode(SIM_Type * base,
                                uint32_t instance,
                                sim_lpuart_txsrc_t select);

/*!
* @brief Gets the LPUARTx transmit data source select setting.
*
* This function  gets the LPUARTx transmit data source select setting.
*
* @param base Register base address of SIM.
* @param instance LPUART instance.
* @return select UARTx transmit data source select setting.
*/
sim_lpuart_txsrc_t SIM_HAL_GetLpuartTxSrcMode(SIM_Type * base, uint32_t instance);

/*!
* @brief Sets the LPUARTx Open Drain Enable setting.
*
* This function  enables/disables the LPUARTx Open Drain.
*
* @param base Register base address of SIM.
* @param instance LPUART instance.
* @param enable Enable/disable LPUARTx Open Drain
*				 - True: Enable LPUARTx Open Drain
*				 - False: Disable LPUARTx Open Drain
*/
void SIM_HAL_SetLpuartOpenDrainCmd(SIM_Type * base, uint32_t instance, bool enable);

/*!
* @brief Gets the LPUARTx Open Drain Enable setting.
*
* This function  gets the LPUARTx Open Drain Enable setting.
*
* @param base Register base address of SIM.
* @param instance LPUART instance.
* @return enabled True if LPUARTx Open Drain is enabled.
*/
bool SIM_HAL_GetLpuartOpenDrainCmd(SIM_Type * base, uint32_t instance);

/*!
* @brief Sets the UARTx Open Drain Enable setting.
*
* This function  enables/disables the UARTx Open Drain.
*
* @param base Register base address of SIM.
* @param instance UART instance.
* @param enable Enable/disable UARTx Open Drain
*				 - True: Enable UARTx Open Drain
*				 - False: Disable UARTx Open Drain
*/
static inline void SIM_HAL_SetUartOpenDrainCmd(SIM_Type * base,
                                               uint32_t instance,
                                               bool enable)
{
    // Only support UART2
    assert (2 == instance);
    SIM_BWR_SOPT5_UART2ODE(base, enable ? 1 : 0);
}

/*!
* @brief Gets the UARTx Open Drain Enable setting.
*
* This function  gets the UARTx Open Drain Enable setting.
*
* @param base Register base address of SIM.
* @param instance UART instance.
* @return enabled True if UARTx Open Drain is enabled.
*/
static inline bool SIM_HAL_GetUartOpenDrainCmd(SIM_Type * base,
                                               uint32_t instance)
{
    // Only support UART2
    assert (2 == instance);
    return (bool)SIM_BRD_SOPT5_UART2ODE(base);
}

/*!
* @brief Sets the Timer/PWM x channel y input capture source select setting.
*
* This function  selects the Timer/PWM x channel y input capture source.
*
* @param base     Base address for current SIM instance.
* @param instance     device instance.
* @param channel      TPM channel y
* @param select Timer/PWM x channel y input capture source
*/
void SIM_HAL_SetTpmChSrcMode(SIM_Type * base,
                             uint32_t instance,
                             uint8_t channel,
                             sim_tpm_ch_src_t select);

/*!
* @brief Gets the Timer/PWM x channel y input capture source select setting.
*
* This function  gets the Timer/PWM x channel y input capture source select setting.
*
* @param base     Base address for current SIM instance.
* @param instance     device instance.
* @param channel      Tpm channel y
* @return select Timer/PWM x channel y input capture source select setting
*/
sim_tpm_ch_src_t SIM_HAL_GetTpmChSrcMode(SIM_Type * base,
                                         uint32_t instance,
                                         uint8_t channel);

/*!
* @brief Gets the Kinetis Sub-Family ID in the System Device ID register (SIM_SDID).
*
* This function  gets the Kinetis Sub-Family ID in System Device ID register.
*
* @param base     Base address for current SIM instance.
* @return id Kinetis Sub-Family ID
*/
static inline uint32_t SIM_HAL_GetSubFamilyId(SIM_Type * base)
{
    return SIM_BRD_SDID_SUBFAMID(base);
}

/*!
* @brief Gets the Kinetis SeriesID in the System Device ID register (SIM_SDID).
*
* This function  gets the Kinetis Series ID in System Device ID register.
*
* @param base     Base address for current SIM instance.
* @return id Kinetis Series ID
*/
static inline uint32_t SIM_HAL_GetSeriesId(SIM_Type * base)
{
    return SIM_BRD_SDID_SERIESID(base);
}

/*!
* @brief Gets the Kinetis Fam ID in System Device ID register (SIM_SDID).
*
* This function  gets the Kinetis Fam ID in System Device ID register.
*
* @param base     Base address for current SIM instance.
* @return id Kinetis Fam ID
*/
static inline uint32_t SIM_HAL_GetFamId(SIM_Type * base)
{
    return SIM_BRD_SDID_FAMID(base);
}

/*!
* @brief Gets the Kinetis Pincount ID in System Device ID register (SIM_SDID).
*
* This function  gets the Kinetis Pincount ID in System Device ID register.
*
* @param base     Base address for current SIM instance.
* @return id Kinetis Pincount ID
*/
static inline uint32_t SIM_HAL_GetPinCntId(SIM_Type * base)
{
    return SIM_BRD_SDID_PINID(base);
}

/*!
* @brief Gets the Kinetis Revision ID in the System Device ID register (SIM_SDID).
*
* This function  gets the Kinetis Revision ID in System Device ID register.
*
* @param base     Base address for current SIM instance.
* @return id Kinetis Revision ID
*/
static inline uint32_t SIM_HAL_GetRevId(SIM_Type * base)
{
    return SIM_BRD_SDID_REVID(base);
}

/*!
* @brief Gets the program flash size in the Flash Configuration Register 1 (SIM_FCFG).
*
* This function  gets the program flash size in the Flash Configuration Register 1.
*
* @param base     Base address for current SIM instance.
* @return size Program flash Size
*/
static inline uint32_t SIM_HAL_GetProgramFlashSize(SIM_Type * base)
{
    return SIM_BRD_FCFG1_PFSIZE(base);
}

/*!
* @brief Sets the Flash Doze in the Flash Configuration Register 1  (SIM_FCFG).
*
* This function  sets the Flash Doze in the Flash Configuration Register 1.
*
* @param base     Base address for current SIM instance.
* @param setting Flash Doze setting
*/
static inline void SIM_HAL_SetFlashDoze(SIM_Type * base, uint32_t setting)
{
    SIM_BWR_FCFG1_FLASHDOZE(base, setting);
}

/*!
* @brief Gets the Flash Doze in the Flash Configuration Register 1  (SIM_FCFG).
*
* This function  gets the Flash Doze in the Flash Configuration Register 1.
*
* @param base     Base address for current SIM instance.
* @return setting Flash Doze setting
*/
static inline uint32_t SIM_HAL_GetFlashDoze(SIM_Type * base)
{
    return SIM_BRD_FCFG1_FLASHDOZE(base);
}

/*!
* @brief Sets the Flash disable setting.
*
* This function  sets the Flash disable setting in the
* Flash Configuration Register 1.
*
* @param base     Base address for current SIM instance.
* @param disable      Flash disable setting
*/
static inline void SIM_HAL_SetFlashDisableCmd(SIM_Type * base, bool disable)
{
    SIM_BWR_FCFG1_FLASHDIS(base, disable);
}

/*!
* @brief Gets the Flash disable setting.
*
* This function  gets the Flash disable setting in the
* Flash Configuration Register 1.
*
* @param base     Base address for current SIM instance.
* @return setting Flash disable setting
*/
static inline bool SIM_HAL_GetFlashDisableCmd(SIM_Type * base)
{
    return (bool)SIM_BRD_FCFG1_FLASHDIS(base);
}

/*!
* @brief Gets the Flash maximum address block 0 in the Flash Configuration Register 1  (SIM_FCFG).
*
* This function gets the Flash maximum block 0 in Flash Configuration Register 2.
*
* @param base     Base address for current SIM instance.
* @return address Flash maximum block 0 address
*/
static inline uint32_t SIM_HAL_GetFlashMaxAddrBlock0(SIM_Type * base)
{
    return SIM_BRD_FCFG2_MAXADDR0(base);
}

/*!
 * @brief Gets the Flash maximum address block 1 in Flash Configuration Register 2.
 *
 * This function  gets the Flash maximum block 1 in Flash Configuration Register 1.
 *
 * @param base     Base address for current SIM instance.
 * @return address Flash maximum block 0 address
 */
static inline uint32_t SIM_HAL_GetFlashMaxAddrBlock1(SIM_Type * base)
{
    return SIM_BRD_FCFG2_MAXADDR1(base);
}

/*!
* @brief Sets the Timer/PWM x external clock pin select setting.
*
* This function  selects the source of the Timer/PWM x external clock pin select.
*
* @param base	   Base address for current SIM instance.
* @param instance	   device instance.
* @param select Timer/PWM x external clock pin select
*				 - 0: Timer/PWM x external clock driven by the TPM_CLKIN0 pin.
*				 - 1: Timer/PWM x external clock driven by the TPM_CLKIN1 pin.
*/
void SIM_HAL_SetTpmExternalClkPinSelMode(SIM_Type * base,
                                         uint32_t instance,
                                         sim_tpm_clk_sel_t select);

/*!
* @brief Gets the Timer/PWM x external clock pin select setting.
*
* This function  gets the Timer/PWM x external clock pin select setting.
*
* @param base	   Base address for current SIM instance.
* @param instance	   device instance.
* @return select Timer/PWM x external clock pin select setting
*/
sim_tpm_clk_sel_t SIM_HAL_GetTpmExternalClkPinSelMode(SIM_Type * base, uint32_t instance);


#if defined(__cplusplus)
}
#endif /* __cplusplus*/

/*! @}*/

#endif /* __FSL_SIM_HAL_MKL27Z4_H__*/
/*******************************************************************************
* EOF
******************************************************************************/
